///Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
///456 -> 5
//782 -> 8
//918 -> 1

Console.WriteLine("Введите 3 число:");
string OneNum = Console.ReadLine();
int amount = OneNum.ToString().Length;
int One = Convert.ToInt32(OneNum);
int result = ((One / 10) % 10);

if (amount < 3 || amount > 3)
{
 Console.WriteLine("Вы ввели не трехзначное число");
}
else
{
 Console.WriteLine(result);
}



///Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
///645 -> 5
///78 -> третьей цифры нет
///32679 -> 6


///Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
///6 -> да
///7 -> да
///1 -> нет

